// Написать программу вычисления значения функции y = sin(a). (Класс Math)

double x=Math.PI;
double y=Math.Sin(x);
System.Console.WriteLine(y);
